# YOLOv8m-HDSB (Corrected Version)

nc: 5 # 建议修改为你的实际类别数
scales:
  m: [0.67, 0.75, 768]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 4, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]# 7-P5/32
  - [-1, 2, C2f_HDSB, [1024, True]] # 8 - 替换为 HDSB 模块
  - [-1, 1, SPPF, [1024, 5]]   # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10
  - [[-1, 6], 1, Concat, [1]] # 11 cat backbone P4
  - [-1, 2, C2f, [512]]       # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13
  - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  - [-1, 2, C2f, [256]]       # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17 cat head P4
  - [-1, 2, C2f, [512]]        # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 8], 1, Concat, [1]]  # 20 cat backbone P5 (准确引用 HDSB 输出层)
  - [-1, 2, C2f, [1024]]       # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # 22 Detect(P3, P4, P5)